RhinoInside.Revit API Documentation
GeometryEncoder.ToPolyLine Method
 Converts the specified Rhino.Geometry.Polyline to an equivalent of Autodesk.Revit.DB.PolyLine.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.PolyLine ToPolyLine(
	this Rhino.Geometry.Polyline polyline
)
@staticmethod
def ToPolyLine(
	polyline: Rhino.Geometry.Polyline
) -> Autodesk.Revit.DB.PolyLine
Parameters
polyline
Type: Rhino.Geometry.Polyline
Rhino polyline to convert.
Return Value
Type: Autodesk.Revit.DB.PolyLine
Revit polyline that is equivalent to the provided Rhino polyline.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Polyline. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPolyLine(Polyline) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.PolyLine revitPolyLine = rhinoPolyLine.ToPolyLine();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_polyline = rhino_polyline.ToPolyLine()    # type: DB.PolyLine
 Using ToPolyLine(Polyline) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.PolyLine revitPolyLine = GeometryEncoder.ToPolyLine(rhinoPolyLine);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_polyline = GE.ToPolyLine(rhino_polyline)    # type: DB.PolyLine
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace